Autodesk.Revit.DB.CurtainSystemTypeSet
A set that contains CurtainSystem types.

Autodesk.Revit.DB.CurtainSystemTypeSet.Insert(Autodesk.Revit.DB.CurtainSystemType)
System.Int32
Insert the specified CurtainSystem type into the set.
item: The CurtainSystem type to be inserted into the set.
Returns: Returns whether the CurtainSystem type was inserted into the set.

Autodesk.Revit.DB.CurtainSystemTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.CurtainSystemTypeSet.ReverseIterator
Autodesk.Revit.DB.CurtainSystemTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.CurtainSystemTypeSet.ForwardIterator
Autodesk.Revit.DB.CurtainSystemTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.CurtainSystemTypeSet.Erase(Autodesk.Revit.DB.CurtainSystemType)
System.Int32
Removes a specified CurtainSystem type from the set.
item: The CurtainSystem type to be erased.
Returns: The number of CurtainSystem types that were erased from the set.

Autodesk.Revit.DB.CurtainSystemTypeSet.Contains(Autodesk.Revit.DB.CurtainSystemType)
System.Boolean
Tests for the existence of a CurtainSystem type within the set.
item: The CurtainSystem type to be searched for.
Returns: The Contains method returns True if the CurtainSystem type is within the set, otherwise False.

Autodesk.Revit.DB.CurtainSystemTypeSet.Clear
void
Removes every CurtainSystem type from the set, rendering it empty.

Autodesk.Revit.DB.CurtainSystemTypeSet.Size
System.Int32
get
Returns the number of CurtainSystem types that are in the set.

Autodesk.Revit.DB.CurtainSystemTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.